
# Задание 1
a = int(input("Введите количество км в первый день "))
b = int(input("Введите желаемый результат в км "))
km_day = 0
count = 0
while (km_day <=b):
    km_day = (a+a*0.1)
    count+=1

print(km_day)




# c = (a +a*0.1)
# d = (c + c*0.1)
# e = (d + d*0.1)

